Revit 2026 API

# WireMaterialTypeSetForwardIterator Method

---

Retrieve a forward moving iterator to the set.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual WireMaterialTypeSetIterator ForwardIterator()
```
```vb
Public Overridable Function ForwardIterator As WireMaterialTypeSetIterator
```
```cpp
public:
virtual WireMaterialTypeSetIterator^ ForwardIterator()
```
```fsharp
abstract ForwardIterator : unit -> WireMaterialTypeSetIterator
override ForwardIterator : unit -> WireMaterialTypeSetIterator
```

#### Return Value

WireMaterialTypeSetIteratorReturns a forward moving iterator to the set.

#### Reference

WireMaterialTypeSet Class

Autodesk.Revit.DB.Electrical Namespace